package yi

import (
	"fmt"
	"math/rand"
	"strconv"
	"time"
)

func yi(msg string) string {
	// 以下为卦象
	var m = map[string]string{"000000": "坤为地", "000001": "山地剥", "000010": "水地比", "000011": "风地观", "000100": "雷地豫", "000101": "火地晋", "000110": "泽地萃", "000111": "天地否", "001000": "地山谦", "001001": "艮为山", "001010": "水山蹇", "001011": "风山渐", "001100": "雷山小过", "001101": "火山旅", "001110": "泽山咸", "001111": "天山遯", "010000": "地水师", "010001": "山水蒙", "010010": "坎为水", "010011": "风水涣",
		"010100": "雷水解", "010101": "火水未济", "010110": "泽水困", "010111": "天水讼", "011000": "地风升", "011001": "山风蛊", "011010": "水风井", "011011": "巽为风", "011100": "雷风恒", "011101": "火风鼎", "011110": "泽风大过", "011111": "天风姤", "100000": "地雷复", "100001": "山雷颐", "100010": "水雷屯", "100011": "风雷益", "100101": "火雷噬嗑", "100110": "泽雷随", "100111": "天雷无妄", "101000": "地火明夷", "101001": "山火贲", "101010": "水火既济", "101011": "风火家人", "101100": "雷火豊", "101101": "离为火", "101110": "泽火革", "101111": "天火同人", "110000": "地泽临", "110001": "山泽损", "110010": "水泽节", "110011": "风泽中孚", "110100": "雷泽归妹", "110101": "火泽睽", "110110": "兑为泽", "110111": "天泽履", "111000": "地天泰", "111001": "山天大畜", "111010": "水天需", "111011": "风天小畜", "111100": "雷天大壮", "111101": "火天大有", "111110": "泽天夬", "111111": "乾为天"}
	rand.Seed(time.Now().UnixNano())
	shu := ""
	gua := ""
	for i := 0; i < 6; i++ {
		mian := 0
		yao := 0
		for j := 0; j < 3; j++ {
			bi := rand.Intn(2)
			if bi == 0 {
				mian = 3
			} else {
				mian = 2
			}
			yao += mian
		}
		shu += strconv.Itoa(yao)
		if yao%2 == 0 {
			yao = 0
		} else {
			yao = 1
		}
		gua += strconv.Itoa(yao)
	}
	return fmt.Sprintf("%s\n卜数：%s, 卦数: %s, 对应卦名:%s", msg, shu, gua, m[gua])
}
